app/Controllers/Home.php

INSERT INTO `users` (`user_name`, `user_email`, `user_password`) VALUES ('ach', 'rachnakum0476@gmail.com', '1234')
---
    public function insert()
    {

        if ($this->request->getMethod() == "get") {
            echo view('register');
        } else if ($this->request->getMethod() == "post") {

            if ($this->validate([
                "user_name" => "required",
                "user_email" => "required|valid_email",
                "user_password" => "required|min+length[5]max_length[20]",
                "user_password" => "required",

            ])) {
                $user_name = $this->request->getVar("user_name");
                $user_email = $this->request->getVar("user_email");
                $user_password = $this->request->getVar("user_password");

                //save data in model
                $data = [
                    "user_name" => $user_name,
                    "user_email" => $user_email,
                    "user_password" => $user_password,

                ];
                $model = new UserModel();
                $model->insert($data);

SELECT *
FROM `users`
---
    public function show()
    {
        $model = new UserModel();
        $data['users'] = $model->findAll();

SELECT *
FROM `users`
WHERE `user_email` = 'ankita@gmail.com'
AND `user_password` = '1234'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getMethod() == "get") {
            echo view('login');
        } else if ($this->request->getMethod() == "post") {
            if ($this->validate([
                "user_email" => "required|valid_email",
                "user_password" => "required",

            ])) {
                $model= new UserModel();
                $record=$model->where("user_email",$this->request->getVar("user_email"))
                ->where("user_password",$this->request->getVar("user_password"))
                ->first();